{
    "index_audio_mesg": "Welcome to Weathering Changes App. This app combines historical weather data, predictive modeling, and community-driven insights to help you better understand and prepare for today’s weather and tomorrow’s climate. Whether you're looking to explore the human cost of weather disasters, understand how climate has shifted in your region, or contribute your own observations, this platform brings data to life—and puts climate awareness in your hands.",
    "index_audio_error": "An error has occurred",
    "index_audio_success": "Operation completed successfully",
    "history_audio_mesg": "Welcome to the weather History. The app explores historical and recent weather events with interactive maps and charts. We also analyze long-term climate changes through visualizations and projections. The App emphasizes that; 1. The Weather Can Be Deadly. 2. Climate Is Changing Fast, 3. Temperatures Are Rising, and The Cost of Weather is insurmountable: the Socio Economic Impact is severe and grave indeed!",
    "history_audio_error": "An error has occurred on Hisotry page",
    "history_audio_success": "History page completed successfully",
    "forecast_audio_mesg": "Welcome to Forecast App. The app provides Forecasting Tools that simulate future weather scenarios and plan for various climate outcomes. It also seeks to provide community Insights where we encourage sharing personal experiences and engagement with trivia to foster learning.",
    "forecast_audio_error": "An error has occurred on Forecast page",
    "forecast_audio_success": "Forecast page completed successfully",
    "analytics_audio_mesg": "Welcome to Analytics App. The app provides a Data Exploration, a Dive deep into advanced data visualizations and analyses. The App explores; 1. Clustering: Making Sense of Similar Weather Patterns; 2. Graph Hierarchies: Understanding Climate Interdependencies; 3. Parallel Coordinates - Advanced multivariate analysis visualization and 4. For Future work we plan to make it a REACT single page app.",
    "analytics_audio_error": "An error has occurred on Analytics page",
    "analytics_audio_success": "Analytics page completed successfully",
    "US30DeadliestWeatherDisasters_audio_mesg": "The Weather Can Be Deadly Heatmap of Top 30 Deadliest Weather Disasters in the United States showing the distribution of adverse weather events by state and the associated deaths This heatmap exposes the tragic human toll of extreme weather events, spotlighting the regions most frequently affected and the number of lives lost. The East Coast of the United States has suffered the most but specifically the South (the states of Louisiana, Mississippi, Florida) and New York. It’s a sobering reminder that weather isn’t just an inconvenience, it can be deadly. By examining historical patterns of hurricanes, floods, and heatwaves, users can appreciate the importance of risk-aware planning and stay vigilant in high-risk areas.",
    "US30DeadliestWeatherDisasters_audio_error": "An error has occurred on Analytics page",
    "US30DeadliestWeatherDisasters_audio_success": "Analytics page completed successfully",
    "OccurenceofAnomalies_audio_mesg": "Climate Is Changing Fast Increase in Occurrence of Weather Anomalies in the United States Line graph showing frequency of unusual weather events over time Over the past century, the number of abnormal weather patterns—such as unexpected heat waves or cold spells—has dramatically increased. This graph underscores the shifting climate baseline and the growing unpredictability of daily weather, making long-term planning and adaptive responses increasingly vital.",
    "OccurenceofAnomalies_audio_error": "An error has occurred on OccurenceofAnomalies page",
    "OccurenceofAnomaliesanalytics_audio_success": "OccurenceofAnomalies page completed successfully",
    "WeatherAnomaliesbyState_audio_mesg": "Climate Is Changing Fast Weather Anomalies by State: Unexpected Very Hot and Very Cold Events Bubble map comparing anomalies by region Climate doesn’t change uniformly. Some states experience more frequent and extreme anomalies than others. This chart allows users to identify where unusual temperature events are most common, promoting local-level awareness and the tailoring of response strategies based on regional vulnerability.",
    "WeatherAnomaliesbyState_audio_error": "An error has occurred on WeatherAnomaliesbyState page",
    "WeatherAnomaliesbyState_audio_success": "WeatherAnomaliesbyState page completed successfully",         
    "GlobalTrendSARIMA_audio_mesg": "Temperatures Are Rising Global Trend: SARIMA ModelTime-series forecasting of global temperature trends Using a SARIMA (Seasonal Auto-Regressive Integrated Moving Average) model, this graph captures the long-term warming trend worldwide. It provides a statistical foundation to understand the trajectory of climate change, emphasizing the role of data modeling in anticipating future scenarios.",
    "GlobalTrendSARIMA_audio_error": "An error has occurred on Analytics page",
    "GlobalTrendSARIMA_audio_success": "Analytics page completed successfully",
    "SARIMAbyYear_audio_mesg": "Temperatures Are Rising SARIMA by Year: Yearly Temperature ProjectionsAnnual breakdown of modeled temperature changeZooming in, this visualization presents year-by-year forecasts, revealing not just a steady increase, but also short-term fluctuations. It helps users understand both macro and micro trends in temperature, allowing for seasonal preparation and long-term mitigation strategies.",
    "SARIMAbyYear_audio_error": "An error has occurred on Analytics page",
    "SARIMAbyYear_audio_success": "Analytics page completed successfully",
    "EconomicImpactWeatherDisasters_audio_mesg": "The Cost of Weather: Economic Impact National Overview of Socio and Economic DamageAggregate losses from weather disasters over timeSevere weather doesn’t just affect lives—it impacts livelihoods. This chart quantifies the growing cost of natural disasters, showcasing the billions of dollars lost to storms, fires, floods, and droughts. The trend supports the argument for resilience planning as both a human and financial necessity.",
    "EconomicImpactWeatherDisasters_audio_error": "An error has occurred on Analytics page",
    "EconomicImpactWeatherDisasters_audio_success": "Analytics page completed successfully",
    "WeatherThisWeek_audio_mesg": "Forecasting the Future Weather and Climate Prediction ToolsReal-time and predictive models in actionUnderstanding what’s coming is critical. This section features tools and models that predict short- and long-term weather behavior using historical data, anomalies, and climate trends. Whether for agricultural planning, urban development, or personal safety, forecasting offers a proactive edge.",          
    "WeatherThisWeek_audio_error": "An error has occurred on Analytics page",
    "WeatherThisWeek_audio_success": "Analytics page completed successfully",
    "ShareWeatherExperiences_audio_mesg": "Share Weather Experiences Community Insights and Local StoriesA platform for real-life weather observationsWeather is personal. Through this feature, users can share their experiences—how a heatwave affected their garden or how unexpected snowfall disrupted travel. These stories create a dynamic knowledge exchange, grounding data in lived reality and highlighting the human side of climate variability.",          
    "ShareWeatherExperiences_audio_error": "An error has occurred on Analytics page",
    "ShareWeatherExperiences_audio_success": "Analytics page completed successfully",
    "WeatherTrivia_audio_mesg": "Weather Trivia Learn While You ExploreFun facts and quizzes about climate and weather historyEngage users with interactive trivia designed to educate and entertain. This feature offers bite-sized climate facts, record-setting weather events, and surprising science tidbits to deepen curiosity and encourage climate literacy.",          
    "WeatherTrivia_audio_error": "An error has occurred on Analytics page",
    "WeatherTrivia_audio_success": "Analytics page completed successfully",
    "USClimateFeatures_audio_mesg": "Parallel Coordinates Comparing Multiple Weather Factors Simultaneously for Advanced multivariate analysis visualization. This technical visualization allows power users to explore how multiple variables—<strong>📊 Parallel Coordinates</strong><br>select colorby each variable to see how it affects the weather<br> <em>→ Low temperatures, low humidity are associated with snow, high temperatures with fog, rain and thunder</em><br> <em>→ Not a clear relationship between precipitation and weather</em><br> <em>→ High elevation seems to be correlated with snow</em><br> <em>→ Challenge: did not have good data for all variables.</em>.<br> select Year-2025 and brush for Temperature greater than 70<br> <em>→ A possible correlation between temperatures and humidity, high temperatures = high humidity </em><br> <em>→ 2025 unexpected Winter and Spring high temperatures and humidity for Nebraska, California, Florida, Indiana, South Carolina</em><br>",
    "USClimateFeatures_audio_error": "An error has occurred on Analytics page",
    "USClimateFeatures_audio_success": "Analytics page completed successfully",
    "Clustering_audio_mesg": "Clustering: Making Sense of Similar Weather Patterns Groupings of Similar Events and RegionsAI-driven categorization of weather dataUsing clustering algorithms, this section identifies groups of states or time periods that share similar weather behaviors. It helps users see underlying patterns that traditional charts might miss, enabling smarter analysis and more informed predictions.",            
    "Clustering_audio_error": "An error has occurred on Analytics page",
    "Clustering_audio_success": "Analytics page completed successfully",
    "GraphHierarchies_audio_mesg": "Graph Hierarchies: Understanding Climate Interdependencies Relationships Among Climate VariablesHow temperature, humidity, and event severity interactClimate is a system of interconnected parts. This graph-based visualization illustrates how one variable can affect others—e.g., how rising temperatures might intensify rainfall or prolong drought. It’s a powerful tool for holistic thinking in environmental planning.",            
    "GraphHierarchies_audio_error": "An error has occurred on Analytics page",
    "GraphHierarchies_audio_success": "Analytics page completed successfully",
    "FutureWork_audio_mesg": "For Future work we plan to make it a REACT single page app to achieve ultra vires, the ability to verbally interact with the application without having to click a button on each page to activate the audio dialogue.Also we will make it responsive and also possibly turn it into a Mobile app .  An educational game based on geographical weather for school kids, is also planned .  Finally, we plan to Dockerize the whole application for ease of deployment. Also the graphics will be enhanced to look as good as any weather app outthere currently",            
    "FutureWork_audio_error": "An error has occurred on Analytics page",
    "FutureWork_audio_success": "Analytics page completed successfully"
  }